package org.homework.firefoxsea.application;

/**
 * @author yanghai
 * @since 2020/8/1 18:46
 */
public class ApplicationProvider {
    /**
     面向对象的作业：
     省—学校—班级—老师，学生
     功能：
     1.通过键盘输入的省编码值查找对应的省下面所有的学校
     2.通过输入的学校的编码可以查到具体的学校，学校所属省
     3.输入班级的编号，能查到对应班级，班级的学校，学校所属的省
     3.输入学生的编码能查找到对应的学生的基本信息，比如名字，年龄，住址等信息，学生所属的班级，所属的学校，学校所属的省详细信息
     5.支持按学生姓名的模糊匹配，比如我输入李，我需要找出所有包含李子的学生
     6.支持学校按学校编码模糊查询，比如输入32，需要找出包含32的所有学校，学校的所有班级，班级的所有学生
     7.输入老师的编码，能找到老师的基本信息比如老师的名字，所教科目，老师所带的班级@高津君 @沈怡麟 @张鹤严
     这些行为对应的操作必须由键盘输入，和上次的作业一样，键盘输入，具体怎么实现，每个人可以自由发挥，只要实现上面几点功能就行。这个例子后期我们讲JDBC时可以进行改造
     */
}
